
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data analysis            StataCorp
                                      4905 Lakeway Drive
                                      College Station, Texas 77845 USA
                                      800-STATA-PC        https://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Stata license: Single-user  perpetual
Serial number: 301606346132
  Licensed to: Luke Motley
               

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.

. do "cbsa_to_county.do" 

. import delimited "../input/county_cbsa.csv", case(lower) clear
(12 vars, 1,883 obs)

. drop if mi(cbsacode)
(1 observation deleted)

. 
. keep cbsacode cbsatitle metropolitanmicropo statename fipsstatecode fipscou countycou
> nt

. 
. assert(ustrpos(met, "Metro") | ustrpos(met, "Micro"))

. gen metro_micro = [ustrpos(met, "Metro")] + 1

. 
. lab define metro_micro_lab 1 "Micropolitan Statistical Area" 2 "Metropolitan Statisti
> cal Area"

. lab val metro_micro metro_micro_lab

. 
. rename (cbsacode cbsatitle fipsc county fipss statename) (cbsa cbsa_name cty cty_name
>  state state_name)

. 
. foreach var of varlist *name {
  2.   replace `var' = ustrtrim(`var')
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. compress
  variable metro_micro was float now byte
  (5,646 bytes saved)

. 
. lab data "CBSA to County (NBER)"

. 
. order cbsa cbsa_name metro_micro state state_name cty cty_name

. 
. save "../output/cbsa_to_cty.dta", replace
(note: file ../output/cbsa_to_cty.dta not found)
file ../output/cbsa_to_cty.dta saved

. 
end of do-file
