
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data analysis            StataCorp
                                      4905 Lakeway Drive
                                      College Station, Texas 77845 USA
                                      800-STATA-PC        https://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Stata license: Single-user  perpetual
Serial number: 301606346132
  Licensed to: Luke Motley
               

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.

. do "dma_to_county.do" 

. import excel "../input/county_dma.xlsx", firstrow case(lower) clear
(7 vars, 3,119 obs)

. rename dma dma_name

. 
. foreach char in "(" {
  2.   split dma_name, p("`char'")
  3.   drop dma_name
  4.   rename dma_name1 dma_name
  5.   keep state statefp cntyfp county dma_name
  6. }
variables created as string: 
dma_name1  dma_name2  dma_name3  dma_name4  dma_name5

. 
. replace dma_name = ustrtrim(dma_name)
(3,086 real changes made)

. replace state = ustrtrim(state)
(3,119 real changes made)

. replace county = ustrtrim(county)
(3,118 real changes made)

. 
. tempfile county_dma

. save `county_dma'
file /var/folders/5f/zcch5q8d2q103qwcgxl8js680000gn/T//S_56716.000001 saved

. 
. use dma_json_id dma_name using "../input/dma_merged_analysis_file.dta", clear

. duplicates drop

Duplicates in terms of all variables

(54,860 observations deleted)

. 
. split dma_json_id, p(-)
variables created as string: 
dma_json_id1  dma_json_id2  dma_json_id3

. keep dma*

. rename dma_json_id2 state

. 
. foreach char in "," "-" "(" "&" {
  2.   split dma_name, p("`char'")
  3.   drop dma_name
  4.   rename dma_name1 dma_name
  5.   keep state dma_name dma_json_id
  6. }
variables created as string: 
dma_name1  dma_name2  dma_name3  dma_name4
variables created as string: 
dma_name1  dma_name2  dma_name3  dma_name4
variables created as string: 
dma_name1  dma_name2
variables created as string: 
dma_name1  dma_name2

. 
. replace dma_name = ustrtrim(dma_name)
(3 real changes made)

. replace state = ustrtrim(state)
(0 real changes made)

. 
. replace state = "IL" if dma_name == "CHAMPAIGN"
(1 real change made)

. replace state = "IL" if dma_name == "DAVENPORT"
(1 real change made)

. replace state = "NC" if dma_name == "NORFOLK"
(1 real change made)

. replace state = "VA" if dma_name == "TRI"
(1 real change made)

. replace dma_name = "TRI-CITIES, TN-VA" if dma_name == "TRI"
variable dma_name was str16 now str17
(1 real change made)

. replace dma_name = "WILKES BARRE" if dma_name == "WILKES"
(1 real change made)

. drop if dma_name == "US"
(1 observation deleted)

. 
. merge 1:m state dma_name using `county_dma', nogen
(note: variable state was str2, now str3 to accommodate using data's values)
(note: variable dma_name was str17, now str26 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                           611
        from master                         2  
        from using                        609  

    matched                             2,510  
    -----------------------------------------

. 
. rename (state statefp cntyfp county dma_json_id) (state_abbr state cty cty_name dma)

. 
. order state state_abbr cty cty_name dma dma_name

. 
. compress
  variable state_abbr was str3 now str2
  (3,121 bytes saved)

. 
. export delimited "../output/dma_to_cty.csv", replace
(note: file ../output/dma_to_cty.csv not found)
file ../output/dma_to_cty.csv saved

. 
end of do-file
